Autodesk.Revit.DB.PointCloudInstance.GetPoints(Autodesk.Revit.DB.PointClouds.PointCloudFilter,System.Double,System.Int32)
Extracts a collection of points based on a filter.
Remarks:
If there are more points in the cloud passing the filter than the number requested in this function,
the results may not be consistent if the same call is made again.
filter:
The filter to control which points are extracted. The filter should be passed in the coordinates
of the Revit model.
averageDistance:
Desired average distance between "adjacent" cloud points (Revit units of length).
The smaller the averageDistance the larger number of points will be returned up to the numPoints limit.
Specifying this parameter makes actual number of points returned for a given filter independent of the
density of coverage produced by the scanner.
numPoints:
The maximum number of points requested.
Returns:
A collection object containing points that pass the filter, but no more than the maximum number requested.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The number of points read must range from 1 to 1000000.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for averageDistance must be no more than 30000 feet in absolute value.
Since:
2014

Autodesk.Revit.DB.PointCloudInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.Transform)
Creates a new instance of a point cloud based on an input point cloud type and transformation.
document:
The document in which the new instance is created
typeId:
The element id of the PointCloudType.
transform:
The transform that defines the placement of the instance in the Revit document coordinate system.
Returns:
The newly created point cloud instance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId typeId is not a valid PointCloudType.
-or-
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.PointCloudInstance.ContainsScan(System.String)
Identifies whether the instance contains a scan.
scanName:
Name of the scan.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.PointCloudInstance.SetSelectionFilter(Autodesk.Revit.DB.PointClouds.PointCloudFilter)
Sets active selection filter by cloning of the one passed to it.
Remarks:
The filter is provided in the coordinates of the Revit model.  If the point cloud is
altered (e.g. by moving, rotating, scaling or other modifications) the point cloud
filter is not modified and the set of highlighted or isolated points will change.
The selection filter is not preserved when the Revit document is saved.
pFilter:
The filter object to be made active.  If null is supplied, the
active filter is removed.

Autodesk.Revit.DB.PointCloudInstance.GetSelectionFilter
Returns the currently active selection filter for this point cloud.
Returns:
Currently active selection filter or null if none is active.

Autodesk.Revit.DB.PointCloudInstance.GetRegions
Returns array of region names.
Returns:
Resulting array of region names.
Since:
2017

Autodesk.Revit.DB.PointCloudInstance.GetScanOrigin(System.String)
Returns the origin point of a scan in model coordinates.
scanName:
Name of the scan.
Returns:
Resulting origin point of the scan.
Throws Autodesk.Revit.Exceptions.ArgumentException:
PointCloudInstance does not contain scan scanName.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.PointCloudInstance.GetScans
Returns array of scan names.
Returns:
Resulting array of scan names.
Since:
2014

Autodesk.Revit.DB.PointCloudInstance.HasColor
Returns true if at least one scan of the element have color, false otherwise.
Returns:
True if at least one scan of the element have color, false otherwise.
Since:
2014

Autodesk.Revit.DB.PointCloudInstance.SupportsOverrides
Identifies whether the instance can have graphic overrides.
Since:
2014

Autodesk.Revit.DB.PointCloudInstance.FilterAction
The action taken based on the results of the selection filter applied to this point cloud.
Remarks:
If no selection filter is applied, changing this value will have no visible effect.
The filter is provided in the coordinates of the Revit model.  If the point cloud is
altered (e.g. by moving, rotating, scaling or other modifications) the point cloud
filter is not modified and the set of highlighted or isolated points will change.
The filter action is not preserved when the Revit document is saved.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.PointCloudInstance
Represents a single instance of a point cloud in the Revit document.